import 'package:baby_care/services/description_container.dart';
import 'package:baby_care/services/used_fonts_and_colors.dart';
import 'package:charts_flutter/flutter.dart' as charts;
import 'package:get/get.dart';

List<List<String>> suggestionsProducts = [

  <String>['تيشيرت للاولاد', '5,000', 'assets/images/2.jpg','''تيشيرت أبيض قطني ياقة دائرية بنقشة "day one"(اليوم الاول) مناسب لاول يوم بالروضة، صناعة تركية'''],


  <String>['حفاظات كونفي رقم2', '10,000', 'assets/images/disaprs1.jpg','''
حفاضات كونفي بيبي رقم ٢، تمتص السائل بشكل أسرع بفضل الحبيبات فائقة الامتصاص التي تمنح جفاف أكثر، تحتوي على حاجز قطني كبير تمتص البلل بسرعة. يحتوي الكيس على 44 قطعة.'''],  <String>[' فواكه مهروسة', '1,500', 'assets/images/food4.jpg','هريس الفواكه'],
  <String>['مهروس الفواكه', '13,000', 'assets/images/food3.webp','''هونيلاك حبوب الأطفال. كغذاء تكميلي رائع لحديثي الولادة ، تمتلئ حبوب هونيلاك للأطفال بالعناصر الغذائية والفيتامينات والمكونات التي تشتد الحاجة إليها والتي تضيف إلى خطة النظام الغذائي اليومية العادية للطفل. إنها بداية صحية ممتازة للرضيع على الطعام الصلب.'''],
  <String>[' رضاعة 400 مل', '3,500', 'assets/images/foodtool3.jpg','''تعلّم شرب المشروبات قد يشكّل تحديًا. يتميز هذا الكوب بمقبضين كبيرين يسهّل الإمساك به وعنق عملي يجعله أسهل قليلاً - ونعني دون إراقة للسوائل'''],

  <String>[' شامبو جوي بيبي', '3,000', 'assets/images/bath1.jpg','''شامبو جونسون بخلاصة منتجات طبيعية لطيفة علي فروة رأس الأطفال مع زيت الذي يعمل علي ترطيب بشرة الأطفال وحمايتها من الجفاف
يأتي بسعة 500 مل لايسبب حرقة في العين وينظف ويرطب الشعر ويزيل الاوساخ ويجعل فروة الشعر ناعمة'''],
  <String>['حذاء للاولاد', '5,000', 'assets/images/shoes1.jpg','''هذه الأحذية مصنوعة من مواد مرنة ومسامية تسمح بمرور الهواء لضمان تقليل تعرق القدم لتحافظ عليها جيدا, و ليست فقط داعمة لأقدام الطفل بل هي ذات مظهر جميل وعصري أيضاً!'''],
];

List<List<String>> clothesProducts = [
  <String>['تيشيرت للاولاد', '5,000', 'assets/images/2.jpg','''تيشيرت أبيض قطني ياقة دائرية بنقشة "day one"(اليوم الاول) مناسب لاول يوم بالروضة، صناعة تركية'''],
  <String>['تيشيرت للاولاد', '4,500', 'assets/images/3.jpg','''تيشيرت وردي خامة مرنة ذات جودة عالية وتصميم مميز وياقة دائرية قماش قطني  صناعة تركية'''],
  <String>['تيشيرت للبنات', '7,000', 'assets/images/4.jpg','''تيشيرت قطني درجة اولى ابيض خفيف مع رسمة وحيد القرن في الوسط قالب مريح الاطفال اثناء الارتداء وياقة دائرية قطن 95% زبلاستك 10%'''],
  <String>[' تيشيرت للبنات', '6,000', 'assets/images/5.jpg','''تيشيرت وردي مع رسمة قوس قزح في الوسط قماش قطني مرن ذو جودةعالية صناعة تركية مريح اثناء الحركة مناسب للاجواء االصيفية'''],
  <String>['  سروال اسود', '4,000', 'assets/images/cloths2.jpg'," سروال باللون الازرق الغامق مع نجوم بيضاء منسوجة من الصوف لتحافظ على درجة حرارة الطفل اثناء الاجواء الباردة"],
  <String>['تيشيرت للبنات', '3,000', 'assets/images/7.webp'," تيشيرت وردي مع رسمة فراشة في الوسط قماش قطني مرن ذو جودةعالية صناعة تركية مريح اثناء الحركة مناسب للاجواء االصيفية"],
  <String>['  سروال للاولاد', '6,000', 'assets/images/cloths5.jpg',"سروال رصاسي اللون مع رسمة دب ذات قماش منسوج بطريقة تمكن الهواء من الدخول للجسم ومناسبة للاجواء الربيعية "],
];

List<List<String>> diapersProducts = [
  <String>['حفاظات كونفي رقم2', '10,000', 'assets/images/disaprs1.jpg','''
حفاضات كونفي بيبي رقم ٢، تمتص السائل بشكل أسرع بفضل الحبيبات فائقة الامتصاص التي تمنح جفاف أكثر، تحتوي على حاجز قطني كبير تمتص البلل بسرعة. يحتوي الكيس على 44 قطعة.'''],
  <String>['حفاظات بامبرز رقم6', '9,000', 'assets/images/disapers2.webp','''
توفر حماية متكاملة من البلل لبشرة جافة وصحية 3 قنوات امتصاص توزع البلل بالتساوي وتحبسه بشكل أفضل، توفير حتى 100% حماية من التسرّب 13 ساعة من الجفاف '''],
  <String>['حفاظات مولفكس رقم5', '6,000', 'assets/images/disapers3.jpeg','''
امنح طفلك نومًا مريحًا طوال الليل مع حفاضات الأطفال مولفيكس 72 قطعة مقاس 5 جونيور بتقنية ثلاثية الأبعاد فريدة. تتميز بتناسب تشريحي ونظام جسم ثلاثي الأبعاد لمنع الانزعاج عند الارتداء تحبس المنطقة عالية الامتصاص السوائل بسرعة وتساعد في الحفاظ على جفاف  .'''],
  <String>['حفاظات بيبي شارك رقم 5' , '8,000', 'assets/images/disapers4.jpg','''حفاضات بيبي شارك رقم ٥ الحجم من ٢٥ الى ٥٠ ، ٤٠ قطعة
  مناسبة للاطفال حديثي الولادة سهلة الارتداء
  صُنعت في مصر آمنة للاستخدام'''],
  <String>['حفاظات بيبي جوي رقم5', '15,000', 'assets/images/disapers5.jpg','''، عبوة التوفير الكبير بحجم Medium، مقاس 3، 156 قطعة وسادة ماسية مضغوطة - تبقى جافة وتمنع الانتفاخ حتى بعد ارتداء فوطة واحدة لساعات طويلة في الليل.
امتداد الخصر - يمنع التسرب من المؤخرة .'''],
  <String>['حفاظات ايفي بيبي رقم 3', '3,000', 'assets/images/disapers6.jpg','''حفاظات من ماركة ايفي بيبي يحتوي الكيس على 46 قطعة تحنوي على 4 طبقات فائقة للامتصاص
 مانع تسرب مزدوج مزود بحواجز مانعة للتسرب طبقة داخلية ناعمة على بشرة الطفل الرقيقة  تحافظ على جفاف طفلك'''],
];

List<List<String>> foodProducts = [
  <String>['شوربة اطفال', '13,000', 'assets/images/food1.png','''طعمه لذيذ وشهي ويحبه الأطفال يوفر لجسم الطفل العديد من العناصر الغذائية التي يحتاجها والفيتامينات والمعادن.
سهل الهضم على معدة الطفل.سهل وسريع التحضير، ولا يحتاج أبداً إلى وقت طويل. يسرع من عملية اكتساب الطفل النحيف للوزن.'''],
  <String>['مهروس الفواكه', '13,000', 'assets/images/food2.webp','''مهروس فواكه من نستله 6 أنواع فواكه، 90 غرام من عمر 6 هريس فواكه مغذي ومريح مدعم بفيتامين سي الذي يساعد على دعم تطور الدماغ والتطور الإدراكي يساهم فيتامين سي بتقوية الجهاز المناعي لطفلك مصنوع من فواكه طبيعية 100% سهلة الهضم
'''],
  <String>['مهروس الفواكه', '13,000', 'assets/images/food3.webp','''هونيلاك حبوب الأطفال. كغذاء تكميلي رائع لحديثي الولادة ، تمتلئ حبوب هونيلاك للأطفال بالعناصر الغذائية والفيتامينات والمكونات التي تشتد الحاجة إليها والتي تضيف إلى خطة النظام الغذائي اليومية العادية للطفل. إنها بداية صحية ممتازة للرضيع على الطعام الصلب.'''],
  <String>['مهروس الفواكه ', '1,500', 'assets/images/food4.jpg','''مهروس فواكه من نستله 6 أنواع فواكه، 90 غرام من عمر 6 هريس فواكه مغذي ومريح مدعم بفيتامين سي الذي يساعد على دعم تطور الدماغ والتطور الإدراكي يساهم فيتامين سي بتقوية الجهاز المناعي لطفلك مصنوع من فواكه طبيعية 100% سهلة الهضم
'''],
  <String>[' كورن فليكس', '3,000', 'assets/images/food5.jpg','''رقائق الذرة والحليب من Kelloggis هي وجبة فطور مغذية لصباحك المزدحم. يحتوي على نسبة منخفضة من الدهون وخالي من الكوليسترول بشكل طبيعي ، كما أنه يحتوي على الطاقة والبروتين والحديد والكالسيوم والفيتامينات. كل ما عليك فعله هو إضافة الحليب والبدء في يومك النشط.'''],
  <String>[' حليب نوفالاك', '13,000', 'assets/images/food6.webp','''هو الحليب الذي يتناسب مع سن الطفل من بلوغه العام حتى ثلاث سنوات، حيث أنه يحتوي على قدر متوازن من البروتين وغني بالمعادن والفيتامينات والأحماض الدهني لضمان أفضل نمو وتطور للصغير نوفالاك جينيو 3 هو حليب تم تحضيره خصيصاً لمرحلة النمو من عمر سنة إلي 3 سنوات'''],
];

List<List<String>> foodToolProducts = [
  <String>[' رضاعة 250 مل', '3,000', 'assets/images/foodtool1.jpeg','''رضاعة اطفال 250 مل من وي بيبي
زجاجة واسعة الفوهة سهلة التعبئة والتنظيف سهلة الإمساك بتصميم زجاجة مريح يمكن حمله بسهولة مع غطاء محكم مصنوع من زجاج البورسليكات النقي والآمن المقاوم للحرارة مناسب من عمر 6 - 18 اشهر'''],
  <String>['ملعقة طعام', '1,000', 'assets/images/foodtool2.jpeg','''ملعقة اطعام الاطفال البلاستيكية تضمن راحة طفلك اناء تناول الطعام مع حواف ناعمة لاتؤذي اللثة وتجع الطعام يدخل بانسيابية'''],
  <String>[' رضاعة 400 مل', '3,500', 'assets/images/foodtool3.jpg','''تعلّم شرب المشروبات قد يشكّل تحديًا. يتميز هذا الكوب بمقبضين كبيرين يسهّل الإمساك به وعنق عملي يجعله أسهل قليلاً - ونعني دون إراقة للسوائل'''],
  <String>[' كوب لشرب الماء', '2,000', 'assets/images/foodtool4.webp','''كوب التدريب على الشرب للاطفال الصغار مصنوع من السيليكون مع قشة شرب مزود بمقبضين مثالي للمساعدة على تطوير مهارات الشرب المستقلة بسرعة.'''],
  <String>['كوب لشرب الماء ', '2,250', 'assets/images/foodtool5.webp','''رضاعة بلاستيك للاطفال من ماركة Chicco ، بحلوة من السليكون بتدفق منخفض ، بتقنية anti-colic system المضادة للمغص ،بسعة ٣٠٠ مل.'''],
  <String>['رضاعة 300 مل ', '3,250', 'assets/images/foodtool6.jpg','''رضاعة بلاستيك للاطفال من ماركة Chicco ، بحلوة من السليكون بتدفق منخفض ، بتقنية anti-colic system المضادة للمغص ،بسعة ٣٠٠ مل.'''],
];

List<List<String>> showerToolProducts = [
  <String>[' شامبو جوي بيبي', '3,000', 'assets/images/bath1.jpg','''شامبو جونسون بخلاصة منتجات طبيعية لطيفة علي فروة رأس الأطفال مع زيت الذي يعمل علي ترطيب بشرة الأطفال وحمايتها من الجفاف
يأتي بسعة 500 مل لايسبب حرقة في العين وينظف ويرطب الشعر ويزيل الاوساخ ويجعل فروة الشعر ناعمة'''],
  <String>['منشفة اطفال', '3,000', 'assets/images/bath2.jpeg','منشفة مناسبة للاطفال تحتوي عى نقشط دب الكوالا تمتض الماء بشكل جيد ويمكن للطفل ارتدائها على راسه لتحافظ على دفئه '],
  <String>[' ليفة ناعمة ', '2,500', 'assets/images/bath3.jpg','ليفة حمام طبية خاصة للبيبي من شيكو تتميز بنعومتها ولا تخدش البشرة وتحافظ على نعومتها ونظارتها وذات ملمس جميل وتزيل الاوساخ دون ازعاج الطفل وهو يستحم لجعل حمامه اكثر سعادة '],
  <String>['  مناديل مرطبة', '1,000', 'assets/images/bath4.jpg','أنعشي واحمي بشرة طفلك الرقيقة مع مناديل شيكو المبللة للانتعاش والحماية. المناديل غنية بزيوت الميليسا. زيت الميليسا يعطي رائحة طبيعية خفيفة تهدئ طفلك وتحاف عليه كونها معقمة جيدا وتزيل الجراثيم للحفاظ على طفلك'],
  <String>[' مناديل مرطبة', '13,000', 'assets/images/bath5.webp','لصابون الناعم للأطفال من جونسون هو صابونة للأطفال مثبت علميًّا بأنها لطيفة وبحجم مناسب وسهلة المسك لكي تحممي طفلك بسهولة، كما وأنها لطيفة للغاية حيث يمكن استخدامها على جسم طفلك بأكمله، بما في ذلك وجهه'],
  <String>[' ليفة ناعمة ', '13,000', 'assets/images/bath6.jpg','تترك البشرة ناعمة ونظيفة دون خدشها او ايذائها ليفة استحمام للاطفال من ماركة Balmy التركية، مصنوعة من الياف البامبو الناعمة مناسبة لبشرة الاطفال الحساسة، تنظف البشرة بلطف وتزيل الشوائب والاوساخ'],

];

List<List<String>> shoesProducts = [
  <String>['حذاء للاولاد', '5,000', 'assets/images/shoes1.jpg','''هذه الأحذية مصنوعة من مواد مرنة ومسامية تسمح بمرور الهواء لضمان تقليل تعرق القدم لتحافظ عليها جيدا, و ليست فقط داعمة لأقدام الطفل بل هي ذات مظهر جميل وعصري أيضاً!'''],
  <String>['حذاء للبنات', '6,000', 'assets/images/shoes2.jpg','''حذاء اطفال بتصميم مميز ومصنوع من بخليط يدمج بين الجلد الطبيعي والايكو ,صنع في الصين تتميز بالتصميم اللطيف وخفة الوزن واللون الزهري وعليها تطعيم بشخصيات كرتونية يحبها الاطفال '''],
  <String>['حذاء رياضي', '7,000', 'assets/images/shoes3.jpg','''حذاء بتصميم مختلف ولون أزرق داكن خفيف مناسب للمشي بدون اربطة لتسهيل الارتداء مغطى بالقماش للسماح بنفاذ الهواء يوفر مرونة عالية بالحركة للسماح للطفل باللعب والحركة بحرية'''],
  <String>['جذاء للبنات ', '6,000', 'assets/images/shoes4.jpg','''حذاء كاجول بلون وردي وشكل لطيف الاطفال من عمر سنة مناسب للنزهات مريح لقدم الطفل ويتيح سهولة الحركة واللعب صنع في الصين من اجود انواع القماش لضمان راحة القدم'''],
  <String>[' حذاء رياضي', '7,000', 'assets/images/shoes5.jpg','''حذاء رياضي بلون ازرق فاتح مغطى بالقماش المرن للسماح بنفاذية الهواء مع نعل سفلي ثابت ومرن صمم خصيصا لراحة الطفل والحماية من الانزلاق مرتفع بمقدرا ٣ سم تقريبا عن الارض'''],
];
List<List<String>> vehiclesProducts = [
  <String>['عربة اطفال زهرية', '30,000', 'assets/images/vichales1.webp',' عربة الاطفال المحسّنة من ساين بيبي قابلة للطي، سرير للطف، عربة بمقعد واحد لحديثي الولادة والاطفال، لون زهري جميل مع مظلة لابعاد اشعة الشمس عن الطفل  مع حامل لحقيبة تضعين فيها اغراض طفلك لتقليل الجهد'],
  <String>['عربة اطفال', '45,000', 'assets/images/vichales2.jpg','عربة الاطفال المحسّنة من ساين بيبي قابلة للطي، سرير للطف، عربة بمقعد واحد لحديثي الولادة والاطفال، لون بنفسجي مريحة في اثناء المشي والتنقل ولا تسبب ضجيج يزعج الطفل  لانها صممت بطريقة خاصة تقلل الارتجاج '],
  <String>['عربة اطفال', '35,000', 'assets/images/vichales5.jpg','عربة الاطفال المحسّنة من ساين بيبي قابلة للطي، سرير للطف، عربة بمقعد واحد لحديثي الولادة والاطفال، لون بنفسجي مريحة في اثناء المشي والتنقل ولا تسبب ضجيج يزعج الطفل  لانها صممت بطريقة خاصة تقلل الارتجاج'],
  <String>[' عربة اطفال ', '35,000', 'assets/images/vichales6.jpg','عربة الاطفال المحسّنة من ساين بيبي قابلة للطي، سرير للطف، عربة بمقعد واحد لحديثي الولادة والاطفال، لون بنفسجي مريحة في اثناء المشي والتنقل ولا تسبب ضجيج يزعج الطفل  لانها صممت بطريقة خاصة تقلل الارتجاج '],
  <String>['عربة لتعليم المشي ', '20,000', 'assets/images/vichales4.jpg','''يتميز جهاز المشي الصغير بصينية صغيرة تتيح لك تعزيز متعة طفلك مع الألعاب الأخرى إذا كنت ترغب في ذلك. يمكن تنظيف الدُرج بسهولة عن طريق قماشة مبللة، وهو أمر رائع إذا كنت تريد اطعام الطفل أثناء اللعب كما قد تتوقع تسمح المشاية بتعديل الارتفاع الي ثلاث اعدادات متوفرة باللون الزهري'''],
  <String>['عربة لتعليم المشي ', '25,000', 'assets/images/vichales3.jpg','''يتميز جهاز المشي الصغير بصينية صغيرة تتيح لك تعزيز متعة طفلك مع الألعاب الأخرى إذا كنت ترغب في ذلك. يمكن تنظيف الدُرج بسهولة عن طريق قماشة مبللة، وهو أمر رائع إذا كنت تريد اطعام الطفل أثناء اللعب كما قد تتوقع تسمح المشاية بتعديل الارتفاع الي ثلاث اعدادات متوفرة باللون الازرق'''],
];

List<List<String>> containersProducts = [
  <String>['حاضنة', '15,000', 'assets/images/container1.jpg','''سرير الأطفال من كيبكو، مهد للاطفال على شكل عش مع وسادة، قطن ناعم 100%، قماش مسامي للتهوية مضاد للحساسية، مريح، مع غطاء من نسيج مسامي للتهوية ولابعاد الحرات لجعل بيئة نوم الطفل اكثر امان وايضا يمكن ازالته للاطفال حديثي الولادة'''],
  <String>['حاضنة', '55,000', 'assets/images/container2.webp','يعتبر هذا السرير المتنقل الخيار الأمثل لطفلك الصغير، إذ يأتي بتصميم سهل التركيب والطيّ وجدران شبكية لحماية طفلك من الأغبرة والبعوض أو من الملوثات الأخرى مع وسادة ناعمة تجعل نوم الطفل اكثر عمقا وتسهيل حركة راسه  '],
  <String>['حاضنة', '10,000', 'assets/images/container3.jpg','''سرير الأطفال المحمول ، والذي يمكن طيه وحمله بسهولة للأطفال حديثي الولادة. يتم وضع هذا النوع من الأسرة مباشرة في وسط السرير الكبير . إنه ينقل الطفل إلى وضع أكثر أمانًا وأوسع لتجنب انضغاط الطفل أو سقوطه من السرير.خفيف الوزن وصغير الحجم لسهولة النقل في السفر.'''],
  <String>[' حاضنة', '35,000', 'assets/images/container4.jpg','سرير اطفال هزاز من ماركة ديكات التركية بتصميم فريد وجودة عالية يلحق بالسرير مفرش كامل للطفل يشمل المرتبة والجوانب والمخدة واللحاف بالاضافة للناموسية لينعم طفلك بنوم هادئ ومريح مناسب منذ الولادة حتى عمر 3 سنوات'],
  <String>['حاضنة ', '40,000', 'assets/images/container5.jpg','سرير متنقل مزود بعجلات لنقل السرير من غرفة إلى أخرى، مع وجود قفل على كل عجلة لتثبيت السرير ومنعه من الحركة عند عدم الحاجة لنقله. يُسهل هذا النوع مراقبة الطفل أثناء القيام بالأعمال المنزلية. بالإضافة إلى إمكانية طيه عند عدم الحاجة لاستخدامه.'],
  <String>['حاضنة ', '45,000', 'assets/images/container6.jpg','''سرير أطفال ومهد الأطفال من سوينج بيبي كوت  مصنوعة من سبيكة الألومنيوم وخفيفة الوزن وتحمل قوي، ونوافذ شبكية جانبين تسمح برؤية الطفل وتهويته. مرتبة مريحة لطفلك، 2 في 1 وضع هزاز قابل للتحويل - سواء استخدمه كسرير أطفال أو كسرير ثابت.'''],
];

List<List<String>> furnitureProducts = [
  <String>['وسادة', '10,000', 'assets/images/furniture1.jpg','''وسادة أطفال  40*24*3 سم حديثي الولادة من باماكس، وسادة ذات رأس مسطحة طويلة لحديثي الولادة،بشكل ميني ماوس شخصية مقدمة من دزني ,تمنح مساندة مناسبة لرأس الطفل'''],
  <String>['غطاء شتوي', '13,000', 'assets/images/furniture2.jpeg','''بطانية للاطفال مخملية من الياف الصوف من تيليو، كبيرة خفيفة الوزن لسرير الاطفال، بطانية فائقة النعومة لتدفئة الاطفال الصغار، مقاس كبير 40×50 انش تمنح طفلك نوم دافئ وهادئ'''],
  <String>['وسادة صغيرة', '3,000', 'assets/images/furniture3.jpeg','''وسادة أطفال  27 × 27 سنتيمتر  على شكل قلب ،وسادة ناعمة لحديثي الولادة ، لتزيين الفراش هي قادرة على جعل الغرفة الأكثر مملة والكئيب الأصلي وجميلة. يملأ هذا الديكور الغرفة بألوان جديدة ، ويخلق جواً غير عادي في المنزل!'''],
  <String>[' غطاء', '7,000', 'assets/images/furniture4.jpeg','''تلعب بطانية الأطفال القطنية دورًا مهمًا في تدفئة طفلكِ بشكل فعال بفصل الشتاء، فيمكنكِ استخدامها كغطاء لسرير طفلك يوفر له التدفئة المثالية بشكل أسرع من الملاءة العادية'''],
  <String>[' بطانية', '8,000', 'assets/images/furniture5.jpeg','''هذه البطانية القطنية دافئة ومسامية، وخفيفة الوزن، ومناسبة للاستخدام في جميع المواسم تتميز بملمسها الناعم على البشرة، وجودتها العالية، تأتي هذه البطانية بحجم 120 سنتيمترًا × 90 سسنتيمترًا'''],
  <String>['وسادة كبيرة ', '6,000', 'assets/images/furniture6.jpeg','''مع وسادة حديثي الولادة كبيرة الحجم ، يمكن أن يستلقي الطفل في وضع مريح يضمن التنفس الطبيعي أيضًا. وسادة الأطفال حديثي الولادة مفيدة للطفل لتطوير شكل الرأس المناسب في سن مبكرة'''],
];

List<List<String>> doctors = [
  <String>['د.حنان العبيدي', 'أخصائي جلدية', 'assets/images/doctor1.jpg','''خريجة طب عام من جامعة بغداد تخصص جلدية حاصلة على شهادة للتخصص في الامراض الجلدية من جامعة ستانفورد في الولايات المتحدة الامريكية خبرة 3 سنوات بالمجال'''],
  <String>['د.يعقوب قمر الدين ', 'أخصائي انف واذن وحنجرة', 'assets/images/doctor2.jpg','''بكلوريوس من الجامعة المستنصرية كلية الطب دكتوراه بورد عربي من المجلس العربي للاختصاصات الطبية ، مقيم اقدم دراسات عليا/ انف-اذن-وحنجرة في مستشفى اليرموك التعليمي'''],
  <String>['د.علاء الجبوري', 'أخصائي باطنية', 'assets/images/doctor3.jpg','''طبيب اختصاص في الطب الباطني من مستشفى الكاظمية التعليمي منذ عام ٢٠١٥ ، زمالة المجلس العراقي للتخصص الطبي برتبة التخرج الاولى ، عضوية كلية الطب الملكية الجزء( الاول )'''],
  <String>['د.مريم الدليمي', 'أخصائي جهاز تنفسي', 'assets/images/doctor4.jpg','''اختصاص الامراض الصدرية والتنفسية دورة ١٩٩٠ كلية الطب بغداد، بورد تخصص دقيق بامراض الجهاز التنفسي ، زمالة كلية الاطباء الملكية البريطانية لندن وادنبرة'''],
  <String>['د.  اسماعيل احمد', 'أخصائي اسنان', 'assets/images/doctor5.jpg','''بكالريوس طب وجراحة الفم و الاسنان ، مقيم اقدم جراحة الوجه والفكين وزارة الصحة/كلية الكاظمية، خبرة ٦ سنوات في المجال'''],
  <String>['د.عثمان عبدالجليل', 'أخصائي تغذية', 'assets/images/doctor6.jpg','''خريج  قسم التغذية والحِمْيات في جامعة جيهان- أربيل ،بكلوريوس من جامعة الملك فيصل كلية العلوم الزراعية و الأغذية لتخصص علم الاغذية بتقدير جيد جدا مع مرتبة الشرف الثانية'''],
  <String>['د.محمد سنبل', 'أخصائي اورام', 'assets/images/doctor7.jpg','''خريج جامعة بغداد كلية الطب متخصص في علاج الأورام بالإشعاع, تخرج من جامعة تراقيا كلية الطب, جامعة اسطنبول, كلية الطب قسم الأورام الإشعاعية، أخصائي طبيب، مستشفى أرضروم بولجي للتدريب والبحوث'''],
];

String moeText =
    'والله والله والله وانت مامحلفني هذا التيشيرت الا يخبل خاماية غير تركي ماركة فول ليكرا تشك شك شنو ثلج  بالصيف ونار بالشتا ولاعبالك ب3 وونص اخذهة وبيهة ضمان شهرين لا تنشك ولا تنفتك غير اصلية مال عمك اخذهة وخل ابنك يتهنة';

String doctorText =
    'بكلوريوس طب عام من جامعة بغداد كلية الطب تخصص الرعاية الصحية للأطفال من جامعة ميونخ بورد الرعاية الصحية للأطفال من جامعة كامبريدج...';

class RateSeries {
  final String starsNumber;
  final int count;
  final charts.Color barColor;

  RateSeries(
      {required this.starsNumber, required this.count, required this.barColor});
}

final List<RateSeries> data = [

  RateSeries(
    starsNumber: '5',
    count: 25,
    barColor: charts.ColorUtil.fromDartColor(pointNineWhiteColor.value),
  ),
  RateSeries(
    starsNumber: '4',
    count: 20,
    barColor: charts.ColorUtil.fromDartColor(pointNineWhiteColor.value),
  ),
  RateSeries(
    starsNumber: '3',
    count: 15,
    barColor: charts.ColorUtil.fromDartColor(pointNineWhiteColor.value),
  ),
  RateSeries(
    starsNumber: '2',
    count: 10,
    barColor: charts.ColorUtil.fromDartColor(pointNineWhiteColor.value),
  ),
  RateSeries(
    starsNumber: '1',
    count: 5,
    barColor: charts.ColorUtil.fromDartColor(pointNineWhiteColor.value),
  ),
];

RxList<List<String>> comments = [
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  <String>['Thamer Hussein', 'ماكو هيج تيشيرت يخبل بمسؤوليتي وبركبتي (هذا محمد البوي كتبها)'],
  ].obs;

List<List<String>> myOrdersData = [
  <String>['وسادة', '10,000', 'assets/images/furniture1.png','مريحة وتساعد في نوم الطفل'],
  <String>['غطاء شتوي', '13,000', 'assets/images/furniture2.png','مريحة وتساعد في نوم الطفل'],
  <String>['وسادة صغيرة', '3,000', 'assets/images/furniture3.png','مريحة وتساعد في نوم الطفل'],
  <String>[' غطاء', '7,000', 'assets/images/furniture4.png','مريحة وتساعد في نوم الطفل'],
  <String>[' بطانية', '8,000', 'assets/images/furniture5.png','مريحة وتساعد في نوم الطفل'],
  <String>['وسادة كبيرة ', '6,000', 'assets/images/furniture6.png','مريحة وتساعد في نوم الطفل'],
];

// class ProductRating {
//   final String comment;
//   final double stars;
//
//   ProductRating(this.comment
//       ,this.stars
//       );
//
//   static RxList<ProductRating>? productCommentsAndStars = [].obs as RxList<ProductRating>?;
//
//   static add(String comment,double stars) {
//     productCommentsAndStars?.value.add(ProductRating(comment,stars));
//   }
// }
//
// List<String> productComment = [];
// addComment(String comment) {
//   productComment.add(comment);
// }

RxList<dynamic> productRating = [].obs;
